//---------------------------------------------------------------------
#include "ScenarioData.h"

//---------------------------------------------------------------------
ScenarioData::ScenarioData()
{
    name = "宮本";
    text1 = "「タイムトラベルの理論はどれも思考実験です。";
    text2 = "それらの理論からでは、実際にタイムマシンを作る";
    text3 = "ことはできないということ。それが私からの回答です」";
}
//---------------------------------------------------------------------
ScenarioData::~ScenarioData()
{

}
//---------------------------------------------------------------------
std::string ScenarioData::getName()
{
    return name;
}
//---------------------------------------------------------------------
std::string ScenarioData::getText1()
{
    return text1;
}
//---------------------------------------------------------------------
std::string ScenarioData::getText2()
{
    return text2;
}
//---------------------------------------------------------------------
std::string ScenarioData::getText3()
{
    return text3;
}
//---------------------------------------------------------------------